<pre>

(8) การบริหารจัดการเหตุการณ์ผิดปกติและปัญหา (IT incident and problem management)
    ต้องบริหารจัดการเหตุการณ์ผิดปกติและปัญหาที่เกิดจากการใช้เทคโนโลยีอย่างเหมาะสมและทันท่วงทีโดย มีส่วนประกอบดังนี้  
    - การบันทึก 
    - วิเคราะห์ 
    - การรายงานเหตุการณ์ผิดปกติ
    - ขั้นตอนและเงื่อนไขการรายงานเหตุ
    - เงื่อนไขการยกระดับจากเหตุการณ์ (event) ไปเป็นเหตุการณ์ผิดปกติ (Incident)
    - การบันทึกปัญหา 
    - การแก้ไขและการบันทึกแนวทางการแก้ไข 
    - รายการผู้มีส่วนเกี่ยวข้องแต่ละขั้นตอน 
    - การแบ่งผู้รับผิดชอบ เป็น 3-Tier หรือมากกว่า  
    - ต้องมีการกำหนดผู้ทำหน้าที่เป็น Tier 1 
    - ต้องมีการกำหนดผู้เป็นบทบาท Security Analysis  
    - ต้องมีการกำหนดผู้เป็นบทบาท Security Manager เพื่อประสานงาน 
    - ต้องมีการกำหนดขั้นตอนที่ชัดเจน และอำนาจสั่งการ ที่ชัดเจน ในการประสานงานข้ามสังกัด 
    - ต้องมีแผนและขั้นตอน สำหรับ ชี้แจงปัญหา ทั้งกับผู้ใช้งาน ผู้บริหาร และสื่อ Social ต่างๆ  
    - ต้องมีการอบรม เจ้าหน้าที่ที่ทำงานให้ รับรู้แนวโน้มปัญหาใหม่ๆ ที่เกิดขึ้นจากระบบเอง
    - ต้องมีการอบรม เจ้าหน้าที่ที่ทำงานให้ รับรู้แนวโน้มปัญหาการโจมตีใหม่ๆ จากในประเทศ และจากทั่วโลก  
    
    สิ่งสำคัญที่ต้องปฏิบัติเมื่อเกิดเหตุผิดปกติแล้ว
    - การรายงานต้อง รายงานให้คณะกรรมการที่ได้รับมอบหมาย หรือผู้บริหารระดับสูงที่ได้รับมอบหมาย
    ในระยะเวลาที่เหมาะสม 
    - ต้องมีการวิเคราะห์สาเหตุที่แท้จริง (root cause) ของปัญหา เพื่อหาแนวทางแก้ไขจากสาเหตุที่แท้จริง 
    และป้องกันไม่ให้เกิดเหตุการณ์ผิดปกติซ้าในอนาคต

</pre>