<pre>

(7) การจัดหาและการพัฒนาระบบ (system acquisition and development)
    
    (7.1) การจัดหาระบบ (system acquisition) ต้องกำหนดหลักเกณฑ์ที่ชัดเจนและเหมาะสม ในการคัดเลือกระบบ
    และบุคคลภายนอกที่เป็นผู้ให้บริการ เช่น ความน่าเชื่อถือของระบบและผู้ให้บริการที่ได้รับการรับรองตามมาตรฐานสากล
    หรือมาตรฐานด้านเทคโนโลยีสารสนเทศที่เกี่ยวข้องที่ได้รับการยอมรับโดยทั่วไป (certificate) 
    ความมั่นคงปลอดภัยของระบบ การสนับสนุนและการบำรุงรักษาระบบ เพื่อให้มั่นใจว่าระบบและผู้ให้บริการสามารถตอบสนอง
    ต่อความต้องการในการดำเนินธุรกิจของสถาบันการเงินได้รวมถึงต้องคำนึงถึงความยืดหยุ่นในการเปลี่ยนแปลงผู้ให้บริการ 
    การเปลี่ยนแปลงเทคโนโลยี หรือการเปลี่ยนแปลงกลยุทธ์ในการดำเนินธุรกิจในอนาคต

    (7.2) การพัฒนาระบบ (system development) สถาบันการเงินต้องออกแบบ พัฒนา และทดสอบระบบ
    เพื่อให้มั่นใจว่าระบบมีความถูกต้อง มั่นคงปลอดภัย เชื่อถือได้ พร้อมใช้งาน และมีความยืดหยุ่นเพียงพอ
    ที่จะรองรับการปรับปรุงเปลี่ยนแปลงระบบในอนาคต โดยสถาบันการเงินต้องดำเนินการอย่างน้อยในเรื่องดังต่อไปนี้

    - มีเอกสารรายละเอียดคุณสมบัติทางเทคนิค (technical specification) โดยครอบคลุมถึงเรื่องการรักษาความ
    มั่นคงปลอดภัย ซึ่งรวมถึงกระบวนการทดสอบ การดูแล และการติดตามความมั่นคงปลอดภัยในการใช้งาน

    - มีกระบวนการหรือเครื่องมือควบคุมเวอร์ชันของคำสั่งเขียนโปรแกรม (source code version control) โดยมีเงื่อนไขดังนี้
        
        -- ห้ามเก็บรหัสผ่านผู้ใช้ และรหัสผ่านฐานข้อมูล version control 
        -- ควรแยกไฟล์รหัสผ่านแยกไว้ต่างหาก และไม่รวมไว้ใน version control 
        -- version control ที่เลือกใช้ควรมีผู้นิยมใช้ เพื่อแก้ปัญหาในการใช้งานได้ง่าย  และมี patch  

    <!-- - แบ่งแยกบทบาทหน้าที่และความรับผิดชอบของผู้ที่เกี่ยวข้องในกระบวนการพัฒนาระบบ เช่น การแบ่งแยกระหว่างผู้พัฒนาระบบและผู้นำระบบขึ้นใช้งานจริง -->
    - แบ่งแยกสภาพแวดล้อมของระบบงานที่ใช้สำหรับการพัฒนา(development) และการทดสอบ (testing) 
    ออกจากระบบงานที่ให้บริการจริง (production)
    
    - ทดสอบระบบก่อนการใช้งานจริง อย่างน้อยดังต่อไปนี้ 
    <!-- เช่น ทดสอบการทำงานของแต่ละระบบ (unit test) ทดสอบการทำงานร่วมกันของระบบต่าง ๆ (system integration test)
ทดสอบความพร้อมใช้งานตามกระบวนการและความต้องการของผู้ใช้งาน (user acceptance test)
และทดสอบความปลอดภัยของระบบ (security test) ตามกระบวนการรักษาความมั่นคงปลอดภัย
ที่กำหนดในเอกสารรายละเอียดคุณสมบัติทางเทคนิค (technical specification) -->

        -- ทดสอบการทำงานร่วมกันของระบบต่าง ๆ (system integration test) 
        -- ทดสอบความพร้อมใช้งานตามกระบวนการและความต้องการของผู้ใช้งาน (user acceptance test)
        -- ทดสอบความปลอดภัยของระบบ (security test)

    - พัฒนาหรือการเปลี่ยนแปลงระบบที่เกี่ยวข้องกับการให้บริการ หรือการทำธุรกรรมทางอิเล็กทรอนิกส์ 
    ต้องทดสอบประสิทธิภาพ (performance test) เมื่อมีการพัฒนาหรือการเปลี่ยนแปลงระบบที่เกี่ยวข้องกับการให้บริการ
    หรือการทำธุรกรรมทางอิเล็กทรอนิกส์
    
    - มีแนวทางควบคุมการรักษาความมั่นคงปลอดภัยและความลับ ของข้อมูลสำคัญที่นำไปใช้ทดสอบระบบ

    - จัดทำคู่มือและอบรมผู้ใช้งานระบบและผู้ดูแลระบบ โดยมีอย่างน้อยดังนี้     
        - คู่มือผู้ใช้งานระบบ แบบรูปเล่มเอกสาร
        - คู่มือผู้ใช้งานระบบ แบบออนไลน์อ่านได้จากภายในโปรแกรม 
        - หน้าจอที่มีความซับซ้อนยากในการใช้งานต้องมี คำบรรยายอธิบายวิธีใช้คร่าวๆในหน้าจอนั้น
        - คู่มือผู้ดูแลระบบ ทั้งแบบเอกสารและแบบ ออนไลน์  

    - กรณีเป็น web based application 
        - ผู้ใช้งาน และ ผู้ดูแลระบบ ควรแยกกัน ซึ่งอาจแยกด้วย port number หรืออื่นๆ 
        - ฐานข้อมูลรหัสผ่านผู้ใช้ ต้องเข้ารหัสด้วย hash function  
        - ต้องมีการ ติดตั้งและใช้งาน HTTPS แทน HTTP 
        - หน้าเพจ admin ต้องเข้าได้เฉพาะ IP ภายในหน่วยงาน หรือใช้เงื่อนไขอื่นๆ 
</pre>