<pre>
(1) การบริหารจัดการทรัพย์สินด้านเทคโนโลยีสารสนเทศ (IT asset management)
    ต้องบริหารจัดการทรัพย์สินด้านเทคโนโลยีสารสนเทศ
ที่เหมาะสม โดยต้องจัดทำทะเบียนรายการทรัพย์สินด้านเทคโนโลยีสารสนเทศ เพื่อให้สามารถระบุรายการ
ทรัพย์สินด้านเทคโนโลยีสารสนเทศได้อย่างครบถ้วน และสามารถนำไปใช้กำหนดแนวทางการรักษา
ความมั่นคงปลอดภัยด้านเทคโนโลยีสารสนเทศได้อย่างเหมาะสม รวมถึงต้องบำรุงรักษาทรัพย์สิน
ด้านเทคโนโลยีสารสนเทศอย่างสม่ำเสมอ เพื่อให้มีความพร้อมใช้งานและสามารถรองรับการดำเนินธุรกิจ
ได้อย่างต่อเนื่อง

(2) การรักษาความมั่นคงปลอดภัยของข้อมูล (information security)
    ต้องรักษาความมั่นคงปลอดภัยของข้อมูล ทั้งการรับส่ง
ข้อมูลผ่านเครือข่ายสื่อสารและการจัดเก็บข้อมูลบนระบบงานและสื่อบันทึกข้อมูลต่าง ๆ จัดชั้นความลับ
ของข้อมูล (information classification) เก็บรักษาและทำลายข้อมูลให้เหมาะสมกับชั้นความลับ รวมทั้ง
บริหารจัดการการเข้ารหัสข้อมูล (cryptography) ที่เชื่อถือได้และเป็นมาตรฐานสากล เพื่อรักษาความมั่นคง
ปลอดภัยและความลับของข้อมูล

(3) การควบคุมการเข้าถึง (access control) 

    - ต้องควบคุมการเข้าถึงระบบปฏิบัติการ ระบบงาน และระบบฐานข้อมูล โดยกำหนดให้มีการบริหารจัดการสิทธิและตรวจสอบยืนยันตัวตน
ตามสิทธิที่กำหนดไว้ตามความจำเป็นในการใช้งานและระดับความเสี่ยง เพื่อป้องกันการเข้าถึงและเปลี่ยนแปลงระบบหรือข้อมูลโดย
ผู้ที่ไม่มีสิทธิหรือไม่ได้รับอนุญาต

(4) การรักษาความมั่นคงปลอดภัยทางกายภาพและสภาพแวดล้อม (physical and environmental security)
    ต้องรักษาความมั่นคงปลอดภัยของศูนย์คอมพิวเตอร์ สถานที่ปฏิบัติงานที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ 
และพื้นที่ที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศที่สำคัญ รวมทั้งมีระบบการป้องกันและกระบวนการบำรุงรักษาอุปกรณ์คอมพิวเตอร์
และระบบสาธารณูปโภค(facilities) ที่เกี่ยวข้องกับเทคโนโลยีสารสนเทศ เพื่อป้องกันความเสียหายที่อาจเกิดขึ้นจากการบุกรุก
หรือจากภัยธรรมชาติและให้มีความพร้อมใช้งานสามารถรองรับการดำเนินธุรกิจอย่างต่อเนื่อง

(5) การรักษาความมั่นคงปลอดภัยของระบบเครือข่ายสื่อสาร(communications security)
    ต้องรักษาความมั่นคงปลอดภัยของระบบเครือข่ายสื่อสารของหน่วยงาน เพื่อให้ระบบเครือข่ายสื่อสารและข้อมูล
ที่รับส่งผ่านเครือข่ายสื่อสารมีความมั่นคงปลอดภัย และสามารถป้องกันการบุกรุกหรือภัยคุกคามที่อาจเกิดขึ้น


</pre>