<pre>

(6) การรักษาความมั่นคงปลอดภัยในการปฏิบัติงานด้านเทคโนโลยีสารสนเทศ (IT operations security)
    ต้องรักษาความมั่นคงปลอดภัยในการปฏิบัติงานด้านเทคโนโลยีสารสนเทศ โดยต้องครอบคลุมอย่างน้อยในเรื่องดังต่อไปนี้

    (6.1) การบริหารจัดการขีดความสามารถ (capacity management) ของระบบ และระบบสาธารณูปโภค 
    เช่น การประเมินแนวโน้มการใช้ทรัพยากรด้านเทคโนโลยีสารสนเทศ เพื่อให้สามารถบริหารทรัพยากรด้านเทคโนโลยีสารสนเทศ
    ได้อย่างเพียงพอต่อการรองรับการดำเนินธุรกิจและสามารถวางแผนการจัดการเทคโนโลยีสารสนเทศให้รองรับการใช้งาน
    ในอนาคต

    (6.2) การรักษาความมั่นคงปลอดภัยของเครื่องแม่ข่าย (server) และอุปกรณ์ที่ใช้ปฏิบัติงานของผู้ใช้เทคโนโลยี (endpoint) 
    เช่น การติดตั้งโปรแกรมป้องกันไวรัสหรือระบบ ตรวจจับการแฝงตัวของโปรแกรมไม่ประสงค์ดี (malware) หรือ
    การโจมตีด้วยรูปแบบต่าง ๆ เพื่อป้องกันการรั่วไหลของข้อมูลหรือการเข้าใช้งานโดยไม่ได้รับอนุญาต

    (6.3) การสำรองข้อมูล (data backup) ด้วยวิธีการและระยะเวลาที่เหมาะสม เช่น การสำรองข้อมูลประจำวัน 
    เพื่อให้มีข้อมูลสำรองที่มีความพร้อมใช้งานในกรณีที่ระบบ และข้อมูลหลักเกิดเหตุขัดข้องหรือได้รับความเสียหาย

    (6.4) การจัดเก็บข้อมูลบันทึกเหตุการณ์(logging) ของเครื่องแม่ข่ายระบบงาน และอุปกรณ์เครือข่ายที่สำคัญ 
    เช่น การจัดเก็บและสอบทานบันทึกการเข้าถึงระบบ (access log) และบันทึกการดำเนินงาน (activity log) 
    เพื่อให้สามารถติดตามและตรวจสอบการเข้าถึงและการใช้งานระบบหรือข้อมูลและใช้เป็นหลักฐานการทำธุรกรรม
    ทางอิเล็กทรอนิกส์ให้แก่ผู้ใช้บริการ

    (6.5) การติดตามดูแลระบบและเฝ้าระวังภัยคุกคาม (security monitoring) โดยมีกระบวนการหรือเครื่องมือ
    ตรวจจับเหตุการณ์ผิดปกติหรือภัยคุกคามที่มีผลกระทบต่อความมั่นคงปลอดภัยของระบบที่สำคัญ เช่น 
    เครื่องมือติดตามและวิเคราะห์ภัยคุกคามทางไซเบอร์อย่างต่อเนื่อง เพื่อให้สามารถตรวจจับ ป้องกัน 
    และรับมือเหตุการณ์ผิดปกติและภัยคุกคามได้อย่างทันท่วงที

    (6.6) การบริหารจัดการช่องโหว่ (vulnerability management) ของระบบที่เหมาะสมตามระดับความเสี่ยง 
    เพื่อให้ทราบถึงช่องโหว่และสามารถดำเนินการแก้ไขและป้องกันภัยคุกคามที่อาจเกิดขึ้นได้อย่างทันการณ์โดย {{หน่วยงาน}}ต้อง
    ประเมินช่องโหว่ของระบบงานสำคัญทุกระบบอย่างน้อยปีละ 1 ครั้ง และทุกครั้งที่มีการเปลี่ยนแปลงอย่างมีนัยสำคัญ เช่น กรณีที่มี
    การเปลี่ยนแปลงของระบบเทคโนโลยีสารสนเทศ ความเสี่ยง มาตรฐานสากล อย่างมีนัยสำคัญ

    (6.7) การทดสอบเจาะระบบ (penetration test) โดยจัดให้มีผู้เชี่ยวชาญภายในหรือภายนอกที่มีความเป็นอิสระทำหน้าที่
    ทดสอบเจาะระบบ โดยเฉพาะระบบงาน (application) และระบบเครือข่าย (network) ที่เชื่อมต่อกับระบบเครือข่าย
    สื่อสารสาธารณะ (internet facing) สม่ำเสมออย่างน้อยปีละ 1 ครั้ง และทุกครั้งที่มีการเปลี่ยนแปลงอย่างมีนัยสำคัญ 
    เช่น กรณีที่มีการเปลี่ยนแปลงของระบบเทคโนโลยีสารสนเทศ ความเสี่ยง มาตรฐานสากล อย่างมีนัยสำคัญ ทั้งนี้ เพื่อให้ทราบถึง
    ช่องโหว่และสามารถดำเนินการแก้ไขและป้องกันภัยคุกคามที่อาจเกิดขึ้นได้อย่างทันการณ์

    (6.8) การบริหารจัดการการเปลี่ยนแปลง (change management) โดยจัดให้มีกระบวนการบริหารจัดการการเปลี่ยนแปลง
    และควบคุมการเปลี่ยนแปลงอย่างรัดกุมและเพียงพอ เช่น การนำระบบขึ้นใช้งานจริง (system deployment) 
    การตั้งค่าระบบ (system configuration) การติดตั้ง patch เพื่อให้การเปลี่ยนแปลงเป็นไปตามวัตถุประสงค์ที่กำหนดไว้
    อย่างถูกต้องครบถ้วน และป้องกันการเปลี่ยนแปลงโดยที่ไม่ได้รับอนุญาต

    (6.9) การบริหารจัดการการตั้งค่าระบบ (system configuration management) โดยมีกระบวนการควบคุมการตั้งค่า
    ของระบบที่ใช้งานจริง และมีการสอบทานการตั้งค่าอย่างสม่ำเสมอ เพื่อป้องกันข้อผิดพลาดในการปฏิบัติงาน

    (6.10) การบริหารจัดการ patch (patch management) โดยมีกระบวนการควบคุมการติดตั้ง patch ของระบบที่ใช้งานจริง 
    เพื่อให้สามารถติดตั้ง patch ที่สำคัญในการรักษาความมั่นคงปลอดภัยได้อย่างทันการณ์

</pre>