นโยบาย บ้านแบบที่1 
โดย tps

ระบบส่องสว่าง ภายในบ้าน
    ต้องมีระบบแสงสว่างภายในบ้านครบถ้วน
    มีการตรวจระดับแสดงสว่างให้พอเหมาะแก่การอยู่อาศัยในจุดต่างๆ ดังนี้
        - ส่วนอ่านหนังสือ
        - ส่วนทำงาน 
        - ส่วนใช้เครื่องคอมพิวเตอร์
        - ส่วนดูทีวี
        - ส่วนล้างจาน 
        - ส่วนห้องครัว 
    ต้องมีการจัดเก็บข้อมูลค่าแสงสว่างที่เหมาะสมของส่วนต่างๆ ไว้ในแฟ้มเพื่อใช้อ้างอิง โดยต้องมีการระบุถึงแหล่งอ้างอิงด้วย
    อ่างล้างจาน ต้องมีแสงสว่างพอเพียง 

ระบบส่องสว่างภายนอกบ้าน 
    ต้องมีระบบส่องสว่างในเวลากลางคืน เมื่อเดินผ่านจะต้องมีแสงไฟพอมองเห็นได้ 
    รอบบ้าน ต้องมีระบบไฟที่สามารถมองเห็นได้ในระยะไกล หรือสว่างเมื่อเข้าใกล้
    การเดินรอบบ้านเวลากลางคืน ต้องสามารถ ทำได้โดยไม่ต้องถือไฟฉายไป และมองเห็นได้และดูปลอดภัย 
    บริเวณราวตากผ้าต้องมีแสดงสว่างเพียงพอเมื่อตากผ้า โดยอาจติดไฟถาวร หรือไฟสว่างเมื่อเดินผ่านก็ได้
    ไฟโรงรถ ต้องมีแสงสว่างพอเพียงเมื่อเปิดใช้ 
    ส่วนบริเวณเก็บเครื่องมือช่าง ต้องมีแสงสว่างพอเพียง เมื่อเปิดใช้ สามารถมองเห็นเครื่องมือช่างได้อย่างชัดเจน 
    บริเวณโรงรถ เมื่อมาถึงบ้านตอนดึก ต้องมีไฟเห็นหน้าบ้านได้ เมื่อเดินเข้าใกล้หรือเปิดไว้ตลอดเวลา  

เครื่องซักผ้า
    ต้องตรวจดูว่าท่อระบายน้ำไม่ตัน 
    ต้องมี สายกราวด์ติดตั้งเรียบร้อย 

อ่างล้างจาน
    ต้องตรวจดูท่อน้ำเป็นระยะ ทุก 2 ปี ว่ามีท่อรั่วหรือไม่
    หากบริเวณอ่างล้างจานมี สีไม่สวยงาม ต้องทาสีเพิ่มและทำให้สวยงาม 

สายกราวด์ 
    ต้องมีการค้นหาข้อมูลเก็บไว้อ้างอิงพิมพ์เก็บไว้ในแฟ้ม 
    ต้องทำให้ถูกต้อง โดยมีอุปกรณ์ที่ต้องต่อสายกราวด์ได้แก่ 
        - เครื่องซักผ้า
        - เครื่องทำน้ำอุ่น
        - เตาอบ 
        - เตาอบไมโครเวฟ 
        - ตู้เย็น  

รั้วบ้าน
    รั้วบ้าน ด้านนอก
        - ห้ามให้ต้นไม้เลื้อยเลื้อยรก กำแพง 
        - ต้องปรับปรุงให้ดูใหม่เสมอ ให้ทาสีถ้ามีรอยเปื้อน อาจทาสีเองหรือจ้างก็ได้ 
        -
ชิงช้า
    สายชิงช้าต้องเป็น โซ่แข็งแรง หรือ เชือกขนาดใหญ่ และตรวจสอบให้ปลอดภัย
    ไม้กระดานชิงช้า ต้องหาซื้อให้ขนาดพอดี แข็งแรง  
    ส่วนที่เป็นเหล็ก ต้องขัดสนิมออกและ ทาสี ป้องกันไม้ให้มีความแหลมคม 
    การจัดตั้ง ต้องจัดตั้งให้เหมาะสม 
    สีที่ใช้ ควรเป็นสีอ่อนเช่นสีขาว ส่วนพื้นที่นั่งเป็นสีเข้มที่ไม่ใช่สีดำ เช่นสีน้ำตาลลายไม้  

กระถางต้นไม้ที่มีต้นไม้
    ควรหาวิธีจัดทำ ระบบรดน้ำต้นไม้อัตโนมัติ เพื่อให้ต้นไม้สามารถเติบโตได้ดี 
    ต้องรดน้ำสม่ำเสมอ 
    ต้นไม้ทุกต้น ควรมีถาดรองน้ำ เพื่อกันเปื้อนและ เพื่อให้ต้นไม้มีน้ำสำรอง
    ถาดรองน้ำ อาจเป็นสีดำหรือ สีน้ำตาล 
    หากมีคราบเปื้อนใต้กระถางต้นไม้ต้องทำการล้าง และควรล้างอย่างน้อยอาทิตย์ละ 1 ครั้ง
    กิ่งไม้ ต้องมีการตัดแต่งให้สวยงาม
    ต้องมีการให้ปุ่ยเดือนละครั้ง สูตร 16
    การให้ปุ๋ยต้องมีการจดบันทึกใน สมุดที่เก็บบันทึกเฉพาะ  

รถยนต์
    ต้องมีสมุดบันทึก การซ่อมและการเข้าตรวจสภาพรถยนต์ ซึ่งมีการอัพเดทสม่ำเสมอ
    ต้องมีการ บันทึกรายการซ่อมและเปลี่ยนอะไหล่อย่างละเอียด
    เอกสารที่ได้จากการ ซ่อมและตรวจสภาพรถต้องเก็บเข้าแฟ้มเฉพาะ 
    หนังสือประจำรถต้องเก็บไว้ในที่ที่ ค้นหาง่าย 
    ในรถต้องมี สำเนาเอกสารหนังสือประจำรถ  
    ในรถ ต้องมีเอกสารประกันภัย
    ต้องมีการ เช็ควันที่ เสียภาษีรถยนต์ อย่างต่อเนื่อง  
    ต้องมีเอกสาร 1 ใบ เพื่อระบุวันที่ต้องต่อภาษีรถยนต์ และวันต่อประกัน  
    เอกสารที่เก้บในบ้านในเรื่องรถยนต์ต้องเก็บรวมกัน และมีกล่องใส่ที่ปิดฝาได้  

ระบบรดน้ำต้นไม้อัตโนมัติ
    ควรออกแบบ และทดลองสม่ำเสมอ
    เน้นให้เป็นระบบท่อน้ำ โดยใช้ ท่อน้ำที่มีอยู่เป็นหลัก
    ระบบไฟฟ้า ใช้ DC 12 volt แหล่งกำเนิดเป็นหม้อแปลงหรือถ่านชาร์จ
    ระบบไฟฟ้า ไม่เชื่อมต่อทางกายภาย กับ ระบบไฟฟ้าของบ้าน  
    ห้ามใช้ระบบไฟฟ้า AC ในการจัดทำ 
    ระบบควบคุมตั้งเวลา อาจใช้ระบบตั้งเวลาอัตโนมัติตามร้านไฟฟ้า หรือ จัดทำเองด้วย ioT 
    ระบบน้ำจะแยกทางกายภาพ จากระบบน้ำในบ้าน เป็นระบบอิสระ ต้องมีภาชนะใส่น้ำต่างหาก 
    ระบบน้ำจะเป็นระบบ เติมน้ำ การเติมน้ำอาจใช้ ลูกลอย หรือการเติมน้ำแบบ manual 
    ถ้าจะใช้ระบบน้ำหยด ต้องมีระบบกรองน้ำเพื่อป้องกัน การอุดตันของน้ำ  
    ถ้าใช้ระบบน้ำหยด ห้ามให้น้ำหยดต่อเนื่องทั้งวัน ต้องมีช่วงเวลาพักให้ดินแห้งอย่างน้อย 5 ชั่วโมงต่อวัน

ตู้เย็น
    ของกินที่ หมดอายุในตู้เย็น ต้องนำออกทิ้ง 
    ต้องมีการตรวจสอบ ของหมดอายุในตู้เย็น ทุกอาทิตย์ ในช่วงวันหยุด
    ควรจัดทำระบบ เพื่อตรวจสอบการปิดประตูตู้เย็นไม่สนิท และติดตั้ง โดยมีคุณลักษณะดังนี้
        - มีการแจ้งเตือนที่มีเสียงดังชัดเจน 
        - ตอบสนองไวหลังจากไม่ปิดเกิน 2 นาที
        - มีระบบเบาเสียง หรือปิดเสียง 
        - รวมทั้งขนาดเล็กติดตั้งง่าย มั่นคงแข็งแรง 

ห้องน้ำ 
    ต้องพยายามให้ห้องน้ำมีพื้นห้องน้ำที่แห้งอยู่เสมอ เพื่อความสะอาด
    ต้องตรวจสอบว่าพื้นห้องน้ำไม่ลื่น หากพื้นลื่นให้ทำการแก้ไขทันที เช่นใช้สก้อตไบรท์เช็ด 
    ต้องมีรายตากผ้าพอเพียง 
    ถังขยะในห้องน้ำต้องมีการเททิ้งทุกอาทิตย์ เป็นอย่างน้อย 
    สบู่เหลว สบู่ก้อน ยาสระผม ครีมนวดผม ต้องพอเพียง ตรวจสอบทุกอาทิตย์
    ยาสีฟัน ต้องพอเพียง ตรวจสอบทุกอาทิตย์
    ต้องกำจัดสิ่งอุดตันท่อน้ำสม่ำเสมอ 
    อ่างล้างหน้า ต้องเช็ดอย่างน้อย อาทิตย์ละครั้ง
    ท่ออ่างล้างหน้า ต้องตรวจสอบไม่ให้รั่ว หากรั่วต้องทำการแก้ไข  
    กระจก ควรเช็ดทุกอาทิตย์
    เครื่องทำน้ำร้อน ห้ามเปียก
    เครื่องทำน้ำร้อนต้องปิดไฟ หลังการใช้งาน  
    ต้องมีที่ใส่ ผงซักฟอกขนาดเล็ก และมีผงซักฟอกพอเพียงการซักผ้าเล็กๆ
    ห้ามมีกะละมังในห้องน้ำ การใช้งานให้ไปหยิบในที่เก็บ   
    หน้าห้องน้ำต้องมี ผ้าเช็ดเท้าซึ่งซับน้ำได้ดี 
    ที่วางแปรงสีฟัน ต้องมีการตรวจสอบว่ามีความสะอาดสม่ำเสมอ  
    ต้องมีการจัดให้มี ด้ายขัดฟันในห้องน้ำ 
    ชั้นวางสบู่ก้อน ต้องทำความสะอาดให้ไม่มีคราบ ทุกอาทิตย์  
    อุปกรณ์ทำความสะอาดห้องน้ำ ต้องตรวจสอบว่ามีครบถ้วน สม่ำเสมอ 
    กรณีประตูตก ปิดไม่สนิท ต้องจัดซ่อมให้เรียบร้อย  
    ต้องมี เด็ทตอล ในห้องน้ำเพื่อใช้กรณีซักผ้าที่ต้องการให้สะอาดพิเศษ  

การตากผ้า
    ต้องมีไม้แขวนเสื้อ พอเพียงตามจำนวนเสื้อผ้าที่ใช้จริง ทั้งสำหรับผู้ใหญ่และเด็ก
    ต้องมีไม้หนีบผ้า พอเพียงตามจำนวนเสื้อผ้าที่ใช้จริง ทั้งสำหรับผู้ใหญ่และเด็ก
    ราวเสื้อผ้าต้องจัดวางอย่างแข็งแรง ไม่ล้มง่าย 
    ราวเสื้อผ้ากรณี ไม่พอเพียงให้ใช้เชือกขึงเป็นราวได้ แต่ เมื่อใช้แล้วเสร็จต้องรีบเก็บให้เรียบร้อย
    ต้องมีการจัดเตรียมเชือกยาว เพื่อใช้เป็นราวตากผ้าสำรองเก็บวางไว้ในบ้าน บริเวณใกล้เคียงราวตากผ้า
    ไม้หนีบผ้า ต้องจัดเก็บรวมกันไม่ให้กระจาย แต่อาจมีจุดเก็บหลายจุดก็ได้
    การตากผ้า ควรใส่ไม้แขวนเสื้อให้มากที่สุด
    กรณีผ้าที่ใส่ไม้แขวนแล้ว ยังมีโอกาสหลุดจากไม้แขวน ให้ใช้ไม้หนีบหนีบกันหล่น 
    ผ้าที่ตากทีราวโดยไม่ใส่ไม้แขวนให้หนีบด้วยไม้หนีบเพื่อ กันหล่นเมื่อลมพัดแรง  
    จัดให้มีถังใส่ผ้า ให้พอเพียงต่อปริมาณผ้าใช้แล้ว  
    การเก็บผ้าควรเก็บช่วงบ่ายหรือช่วงมีแดด เพื่อผ้าจะไม่ชื้น
    การเก็บผ้าควรนำไปแขวนทันทีไม่ควรกองไว้ เพื่อป้องกันผ้ายับ 
    การตากผ้ายืด ต้องสะบัดผ้าก่อน เพื่อป้องกันผ้ายับ 
    ผ้าควรตากแยกแบ่งเป็นกลุ่มว่าใครเป็นเจ้าของเสื้อผ้า เพื่อให้สะดวกในการจัดเก็บ 

การล้างจาน 
    ควรมีพื้นที่เพียงพอ สำหรับ จัดวางจาน 
    ตรวจสอบทุกอาทิตย์ว่า มีฟองน้ำ สก้อตไบรท์ น้ำยาล้างจาน สำรอง 
    ตรวจสอบทุกอาทิตย์ว่า ฟองน้ำและ สก้อตไบรท์  ใช้งานได้ปกติ
    จัดหาเบคกิงโซดา เก็บไว้ในตู้ เพื่อใช้ล้างคราบไขมันมากๆ เช่น การล้างกระทะทอด 
    การล้างกระทะเคลือบ ห้ามใช้สก้อตไบรท์ ให้ใช้ เฉพาะฟองน้ำหรือ แผ่นสำหรับล้างกระทะเคลือบ หรือใยบวบ 
    ตะหลิวที่มีคราบไหม้ ให้ล้างด้วย ฝอยขัดหม้อ หรือสก้อตไบรท์
    ขยะให้เททิ้งที่ ในถุงขยะแยกจาก ขยะทั่วไป 
    ขยะที่เป็นไม้แหลม ห้ามใส่ไว้ในถุงขยะให้แยกทิ้ง เพื่อป้องกันถุงขยะขาด   
    ควรมีระบบกรองขยะ เพื่อไม่ให้ท่อน้ำมีการอุดตัน 
    ควรมีระบบบำบัดน้ำเสียติดตั้ง
    ที่ล้างจาน ควรทำให้สะอาดเสมอ 
    เมื่อล้างจานเสร็จ ให้เช็ดที่ล้างจานให้แห้ง ไม่มีน้ำเกาะ

กรณีไฟดับ 
    ควรจัดหา ไฟฉายเก็บไว้ ที่บ้าน และมีการชาร์จแล้ว หรือมีแบตเตอร์รี่แห้ง 
    ควรจัดหา อุปกรณ์วัด volt ถ่านไฟฉายเพื่อตรวจถ่านไฟฉาย 
    จัดหาเทียนใหญ่ และ อุปกรณ์จุดไฟเก็บสำรอง  
    การจุดเทียน รอบข้างต้องวางน้ำใกล้ๆ หรือวางเทียนไว้ในจานโลหะเพื่อป้องกันเวลาเทียนล้ม 
    การจุดเทียน ต้องมีคนอยู่ตลอดเวลา  

อุปกรณ์สร้างแแสง UV และโอโซน  
    เวลาเปิดห้าม มอง
    ห้ามให้แสดง ถูกผิวหนัง หรือสายตา เพราะเป็นอันตรายมาก  
    เวลาเปิดห้ามอยู่บริเวณนั้น
    การเปิดให้ต่อสายเข้าไปภายในที่ปิด
    ห้ามสูดดมกลิ่นโอโซน หลังเปิดใช้แล้วให้เปิดห้องให้ลมพัดผ่าน 5 นาทีเป็นอย่างน้อย   
    ใช้สำหรับ ลดกลิ่นและทำความสะอาด เชื้อไวรัส  โดยการเปิดทิ้งไว้ 15 นาที  
        - ห้องน้ำ
        - รถ 
        - ห้องเก็บของ 
        - ห้องนอน 
        - ตู้เก้บเสื้อผ้า  

เอกสารการศึกษาและสำเนาทะเบียนต่างๆ 
    ให้เก็บไว้ร่วมกัน โดยอาจแยกเป็นหลายกล่อง หลายกระเป๋าได้  
    มีการตรวจสอบ ทุก สามเดือน โดยให้มีครบดังนี้ 
        - ทะเบียนบ้าน
        - ใบเกิด
        - ใบสมรส 
        - ใบทะเบียนรถ 
        - ประวัติการศึกษา 
        - ประวัติสุขภาพ
        - โฉนดที่ดิน หลักฐานการจ่ายภาษีที่ดิน 
        - เอกสารการจ่ายภาษี
        - เอกสารการอวยยศ  
        - เอกสารการแต่งตั้ง
        - บัญชีธนาคาร บัญชีเงินฝาก
        - ใบฝึกอบรมที่สำคัญ
        - เบอร์โทรศัพท์ และที่อยู่ ที่สำคัญ 
        - บันทึกประจำวันที่สำคัญอื่นๆ  
        - หลักฐานเกี่ยวกับ รถยนต์และมอเตอร์ไซค์
        - หลักฐานการบริจาค  
    เอกสารสำคัญมาก ควรเก็บในกล่องทนไฟ และง่ายต่อการเคลื่อนย้าย 
    บัตรที่อยู่ในกระเป๋าสตางค์ที่พกไว้ ให้ถ่ายเอกสารไว้ด้วยโดยห้ามถ่ายติดเลข CVV เช่น
        - บัตรเครดิน
        - บัตร ATM 
        - บัตร โรงพยาบาล 
        - บัตรพนักงาน
        - บัตร บริจาค
        - บัตร สมาชิกต่างๆ 
    บัตรที่มีเลข CVV ให้ ใช้สก้อตเทปทึบสีดำหรืออื่นๆที่ลอกง่าย ปิดเลข CVV ไว้
    ควรตรวจให้มั่นใจ ว่า  ที่เก็บจะไม่มีมดมอดหรือแมลง หรือความชื้น เข้ามาทำลายเอกสาร 
    




    














