นโยบาย บ้านแบบที่1 
โดย tps

ระบบส่องสว่าง ภายในบ้าน
    ต้องมีระบบแสงสว่างภายในบ้านครบถ้วน
    มีการตรวจระดับแสดงสว่างให้พอเหมาะแก่การอยู่อาศัยในจุดต่างๆ ดังนี้
        - ส่วนอ่านหนังสือ
        - ส่วนทำงาน 
        - ส่วนใช้เครื่องคอมพิวเตอร์
        - ส่วนดูทีวี
        - ส่วนล้างจาน 
        - ส่วนห้องครัว 
    ต้องมีการจัดเก็บข้อมูลค่าแสงสว่างที่เหมาะสมของส่วนต่างๆ ไว้ในแฟ้มเพื่อใช้อ้างอิง โดยต้องมีการระบุถึงแหล่งอ้างอิงด้วย
    อ่างล้างจาน ต้องมีแสงสว่างพอเพียง 

ระบบส่องสว่างภายนอกบ้าน 
    ต้องมีระบบส่องสว่างในเวลากลางคืน เมื่อเดินผ่านจะต้องมีแสงไฟพอมองเห็นได้ 
    รอบบ้าน ต้องมีระบบไฟที่สามารถมองเห็นได้ในระยะไกล หรือสว่างเมื่อเข้าใกล้
    การเดินรอบบ้านเวลากลางคืน ต้องสามารถ ทำได้โดยไม่ต้องถือไฟฉายไป และมองเห็นได้และดูปลอดภัย 
    บริเวณราวตากผ้าต้องมีแสดงสว่างเพียงพอเมื่อตากผ้า โดยอาจติดไฟถาวร หรือไฟสว่างเมื่อเดินผ่านก็ได้
    ไฟโรงรถ ต้องมีแสงสว่างพอเพียงเมื่อเปิดใช้ 
    ส่วนบริเวณเก็บเครื่องมือช่าง ต้องมีแสงสว่างพอเพียง เมื่อเปิดใช้ สามารถมองเห็นเครื่องมือช่างได้อย่างชัดเจน 
    บริเวณโรงรถ เมื่อมาถึงบ้านตอนดึก ต้องมีไฟเห็นหน้าบ้านได้ เมื่อเดินเข้าใกล้หรือเปิดไว้ตลอดเวลา  

เครื่องซักผ้า
    ต้องตรวจดูว่าท่อระบายน้ำไม่ตัน 
    ต้องมี สายกราวด์ติดตั้งเรียบร้อย 

อ่างล้างจาน
    ต้องตรวจดูท่อน้ำเป็นระยะ ทุก 2 ปี ว่ามีท่อรั่วหรือไม่
    หากบริเวณอ่างล้างจานมี สีไม่สวยงาม ต้องทาสีเพิ่มและทำให้สวยงาม 

สายกราวด์ 
    ต้องมีการค้นหาข้อมูลเก็บไว้อ้างอิงพิมพ์เก็บไว้ในแฟ้ม 
    ต้องทำให้ถูกต้อง โดยมีอุปกรณ์ที่ต้องต่อสายกราวด์ได้แก่ 
        - เครื่องซักผ้า
        - เครื่องทำน้ำอุ่น
        - เตาอบ 
        - เตาอบไมโครเวฟ 
        - ตู้เย็น  

รั้วบ้าน
    รั้วบ้าน ด้านนอก
        - ห้ามให้ต้นไม้เลื้อยเลื้อยรก กำแพง 
        - ต้องปรับปรุงให้ดูใหม่เสมอ ให้ทาสีถ้ามีรอยเปื้อน อาจทาสีเองหรือจ้างก็ได้ 
        -
ชิงช้า
    สายชิงช้าต้องเป็น โซ่แข็งแรง หรือ เชือกขนาดใหญ่ และตรวจสอบให้ปลอดภัย
    ไม้กระดานชิงช้า ต้องหาซื้อให้ขนาดพอดี แข็งแรง  
    ส่วนที่เป็นเหล็ก ต้องขัดสนิมออกและ ทาสี ป้องกันไม้ให้มีความแหลมคม 
    การจัดตั้ง ต้องจัดตั้งให้เหมาะสม 
    สีที่ใช้ ควรเป็นสีอ่อนเช่นสีขาว ส่วนพื้นที่นั่งเป็นสีเข้มที่ไม่ใช่สีดำ เช่นสีน้ำตาลลายไม้  

กระถางต้นไม้ที่มีต้นไม้
    ควรหาวิธีจัดทำ ระบบรดน้ำต้นไม้อัตโนมัติ เพื่อให้ต้นไม้สามารถเติบโตได้ดี 
    ต้องรดน้ำสม่ำเสมอ 
    ต้นไม้ทุกต้น ควรมีถาดรองน้ำ เพื่อกันเปื้อนและ เพื่อให้ต้นไม้มีน้ำสำรอง
    ถาดรองน้ำ อาจเป็นสีดำหรือ สีน้ำตาล 
    หากมีคราบเปื้อนใต้กระถางต้นไม้ต้องทำการล้าง และควรล้างอย่างน้อยอาทิตย์ละ 1 ครั้ง
    กิ่งไม้ ต้องมีการตัดแต่งให้สวยงาม
    ต้องมีการให้ปุ่ยเดือนละครั้ง สูตร 16
    การให้ปุ๋ยต้องมีการจดบันทึกใน สมุดที่เก็บบันทึกเฉพาะ  

รถยนต์
    ต้องมีสมุดบันทึก การซ่อมและการเข้าตรวจสภาพรถยนต์ ซึ่งมีการอัพเดทสม่ำเสมอ
    ต้องมีการ บันทึกรายการซ่อมและเปลี่ยนอะไหล่อย่างละเอียด
    เอกสารที่ได้จากการ ซ่อมและตรวจสภาพรถต้องเก็บเข้าแฟ้มเฉพาะ 
    หนังสือประจำรถต้องเก็บไว้ในที่ที่ ค้นหาง่าย 
    ในรถต้องมี สำเนาเอกสารหนังสือประจำรถ  
    ในรถ ต้องมีเอกสารประกันภัย
    ต้องมีการ เช็ควันที่ เสียภาษีรถยนต์ อย่างต่อเนื่อง  
    ต้องมีเอกสาร 1 ใบ เพื่อระบุวันที่ต้องต่อภาษีรถยนต์ และวันต่อประกัน  
    เอกสารที่เก้บในบ้านในเรื่องรถยนต์ต้องเก็บรวมกัน และมีกล่องใส่ที่ปิดฝาได้  

ระบบรดน้ำต้นไม้อัตโนมัติ
    ควรออกแบบ และทดลองสม่ำเสมอ
    เน้นให้เป็นระบบท่อน้ำ โดยใช้ ท่อน้ำที่มีอยู่เป็นหลัก
    ระบบไฟฟ้า ใช้ DC 12 volt แหล่งกำเนิดเป็นหม้อแปลงหรือถ่านชาร์จ
    ระบบไฟฟ้า ไม่เชื่อมต่อทางกายภาย กับ ระบบไฟฟ้าของบ้าน  
    ห้ามใช้ระบบไฟฟ้า AC ในการจัดทำ 
    ระบบควบคุมตั้งเวลา อาจใช้ระบบตั้งเวลาอัตโนมัติตามร้านไฟฟ้า หรือ จัดทำเองด้วย ioT 
    ระบบน้ำจะแยกทางกายภาพ จากระบบน้ำในบ้าน เป็นระบบอิสระ ต้องมีภาชนะใส่น้ำต่างหาก 
    ระบบน้ำจะเป็นระบบ เติมน้ำ การเติมน้ำอาจใช้ ลูกลอย หรือการเติมน้ำแบบ manual 
    ถ้าจะใช้ระบบน้ำหยด ต้องมีระบบกรองน้ำเพื่อป้องกัน การอุดตันของน้ำ  
    ถ้าใช้ระบบน้ำหยด ห้ามให้น้ำหยดต่อเนื่องทั้งวัน ต้องมีช่วงเวลาพักให้ดินแห้งอย่างน้อย 5 ชั่วโมงต่อวัน

ตู้เย็น
    ของกินที่ หมดอายุในตู้เย็น ต้องนำออกทิ้ง 
    ต้องมีการตรวจสอบ ของหมดอายุในตู้เย็น ทุกอาทิตย์ ในช่วงวันหยุด
    ควรจัดทำระบบ เพื่อตรวจสอบการปิดประตูตู้เย็นไม่สนิท และติดตั้ง โดยมีคุณลักษณะดังนี้
        - มีการแจ้งเตือนที่มีเสียงดังชัดเจน 
        - ตอบสนองไวหลังจากไม่ปิดเกิน 2 นาที
        - มีระบบเบาเสียง หรือปิดเสียง 
        - รวมทั้งขนาดเล็กติดตั้งง่าย มั่นคงแข็งแรง 




